/*blank*/
#include<bits/stdc++.h>
using namespace std;
#define int long long//十年oi一场空，不开ll见祖宗
#define sc scanf
#define pr printf
/*学校里每天会在8:00、8:45、8:55、9:40、10:00、10:45、10:55、11:40、12:30、13:15、13:25、14:10、14:30、15:15、15:25、16:10、16:30、17:15、17:25、18:10、19:30、20:15、20:25、21:10分别响一次铃，有位同学从a点b分到c点d分这个时间段（闭区间）在学校里，问这位同学能听到多少次铃声？

输入描述
这是一道多组案例的题目。一个正整数n，表示案例的数量。（n<=100）

每组案例由4个整数a、b、c、d组成。（保证a点b分和c点d分是合法时间，且a点b分不会晚于c点d分）*/
struct t
{
    int h,m;
};
t a[24]={{8,0},{8,45},{8,55},{9,40},{10,0},{10,45},{10,55},{11,40},{12,30},{13,15},{13,25},{14,10},{14,30},{15,15},{15,25},{16,10},{16,30},{17,15},{17,25},{18,10},{19,30},{20,15},{20,25},{21,10}};
void work()
{
    int aa,b,c,d;
    cin>>aa>>b>>c>>d;
    int ans=0;
    for(int i=0;i<24;++i)
    {
        if((aa*60+b<=a[i].h*60+a[i].m)&&(c*60+d>=a[i].h*60+a[i].m))
            ans++;
    }
    cout<<ans<<'\n';
}
signed main()
{
ios::sync_with_stdio(0);
cin.tie(0);
cout.tie(0);
int _=1;
cin >> _;
//sc("%d",&_);
while (_--)work();
return 0;
}